In [2]:
import psycopg2
import pandas as pd
from pandas import Series, DataFrame

In [3]:
connection = psycopg2.connect(database="01_dvdrental", user="postgres", password="qkrtkddus!1")
cursor = connection.cursor()

In [4]:
cursor.execute("select * from SALES2007_1")
DataFrame(cursor.fetchall(), columns = ["name", "amount"])

   name  amount
0  Mike  150.00
1   Jon  132.00
2  Mary  100.00

In [5]:
cursor.execute("select * from SALES2007_2")
DataFrame(cursor.fetchall(), columns = ["name", "amount"])

   name  amount
0  Mike  120.00
1   Jon  142.00
2  Mary  100.00

In [13]:
cursor.execute("select * from SALES2007_1 union select * from SALES2007_2")
DataFrame(cursor.fetchall(), columns = ["name", "amount"])

   name  amount
0   Jon  132.00
1  Mary  100.00
2  Mike  120.00
3   Jon  142.00
4  Mike  150.00

In [14]:
cursor.execute("select * from SALES2007_1 union all select * from SALES2007_2")
DataFrame(cursor.fetchall(), columns = ["name", "amount"])

   name  amount
0  Mike  150.00
1   Jon  132.00
2  Mary  100.00
3  Mike  120.00
4   Jon  142.00
5  Mary  100.00

In [15]:
cursor.execute("select * from SALES2007_1 intersect select * from SALES2007_2")
DataFrame(cursor.fetchall(), columns = ["name", "amount"])

   name  amount
0  Mary  100.00

In [16]:
cursor.execute("select * from SALES2007_1 except select * from SALES2007_2")
DataFrame(cursor.fetchall(), columns = ["name", "amount"])

   name  amount
0   Jon  132.00
1  Mike  150.00